package OZA_JAVA1_Homework;

public class ComputerXOPlayer {

	/*
	 * Объект Игрок-Компьютер
	 * - рассчитывает ходы (должен иметь доступ ко всем полям и методам объекта Поле)
	 */
	
	public static void doMove() {

	/*
	 * Запросить множество координат всех свободных клеток у поля
	 * Оценить вероятность выигрыша при ходе на каждую из этих клеток
	 * Выбрать для хода клетку с самой высокой оценкой вероятности выигрыша
	 * Передать координаты выбранной клетки полю для отрисовки хода 
	 */
		
		
	
	
	}

}
