package OZA_JAVA1_Homework;

public class GameXOField {

	/*
	 * Объект Поле
	 * - отрисовывает графику поля (пустого или с ходом)
	 * - считывает ходы Игрока (неважно какого)
	 * - хранит информацию о максимальном количестве Клеток в поле
	 * - хранит информацию о доступном количестве пустых Клеток после каждого хода
	 * - пересчитывает доступное количество пустых Клеток после каждого хода
	 * - хранит информацию о количестве заполненных Х линиях поля
	 * - хранит информацию о количестве заполненных О линиях поля
	 */
	
	
}
