package OZA_JAVA1_Homework;

public class MyTask4Class {

	/*
	* Task 4. Алгоритм: сумма цифр числа. 
	* Описать на своем родном языке алгоритм, который получив на вход число, 
	* находит сумму его цифр.
	* Решение. 
	* 
	* Пригласить ввести строку с числом с клавиатуры.
	* Получить все символы из строки в виде массива символов (используя: ToCharArray() ).
	* Определить размер массива (длину строки).
	* Объявить целую переменную (вспомогательную).
	* Инициализировать ее нулем.
	* Объявить массив целых чисел.
	* 
	* В цикле шагов от 1 до N для каждого элемента массива символов:
	* Выполнить повышение типа char к типу int;
	* Записать полученное значение в элемент массива целых чисел.
	* Прибавить значение целого элемента массива к вспомогательной переменной.
	*
	* По окончании цикла вывести вспомогательную переменную, содержащую сумму цифр, на экран.
	*/
	public static void main(String[] args) {
		// TODO Auto-generated method stub

	}

}
